app/controllers/users_controller.rb

INSERT INTO "users" ("nom", "email", "salt", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
 def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 101]]
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "ec0e090576cf4b491ee0364341474211cad03f34ffaec9357fe0928417c3039c"], ["updated_at", "2015-05-12 16:22:58.590548"], ["id", 103]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)

SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @titre = "Tous les utilisateurs"
    @users = User.paginate(:page => params[:page])